Repository: Vistaus/hashit
Catalog: po/*.po
Languages: lt, pl

source: Calculating checksum…
lt: Skaičiuojama kontrolinė suma…
pl: Obliczam sumę kontrolną…

source: Open a file
lt: Atverti failą
pl: Otwórz plik

source: Choose an algorithm
lt: Pasirinkite algoritmą
pl: Wybierz algorytm

source: (optional) paste a reference hash here…
lt: (nebūtina) čia įdėkite nurodomąją maišą…
pl: (opcjonalnie) wklej tutaj źródłową sumę kontrolną…

source: Choose a file or drag one onto this window…
lt: Pasirinkite failą ir vilkite jį į šį langą…
pl: Wybierz plik lub przeciągnij go tutaj…

source: Copy result…
lt: Kopijuoti rezultatą…
pl: Kopiuj wynik…

source: Open
lt: Atverti
pl: Otwórz

source: _Cancel
lt: _Atsisakyti
pl: _Anuluj

source: _Open
lt: A_tverti
pl: _Otwórz

source: All files
lt: Visi failai
pl: Wszystkie pliki

source: Generate and verify file hashes
lt: Generuoti ir patikrinti failų maišas

source: hash;checksum;md5;sha256;
lt: maiša;kontrolinė suma;md5;sha256;

source: A tool that allows you to ensure a file hasn't become corrupted.
lt: Įrankis, kuris leidžia užtikrinti, jog failas netapo pažeistas.

source: Verify files with a reference hash to ensure the integrity of files
lt: Patikrinkite failus pagal maišą, kad užtikrintumėte jų vientisumą

source: Generate file hashes to allow yourself and others to verify file integrity
lt: Generuokite failų maišas, kad leistumėte sau ir kitiems tikrinti failų vientisumą

source: Supports SHA256, SHA1 and MD5 algorithms
lt: Palaiko SHA256, SHA1 bei MD5 algoritmus
